tests/fixtures/OrderCreateRequest.json

{
    "id": 901,
    "address": {
        "billing": {
            "zipCode": "1200",
            "countryCode": "DEU",
            "city": "Hamburg",
            "street": "test",
            "recipient": {
                "firstName": "Anna!",
                "lastName": "Fohlmeister",
                "gender": "m",
                "type": "personal"
            },
            "isDefault": {
                "billing": false,
                "shipping": false
            }
        },
        "shipping": {
            "referenceKey": "InGidcPDmL8fGkv02a3sSAgAr7ySMBfa66iw4MriYgUNI3Boq369rBOZW3stlKLWSqIjB2dXCGNbCxoM5Xww4cI8cULUoGBFJHH0",
            "zipCode": "20459",
            "countryCode": "DEU",
            "city": "Hamburg",
            "street": "Domstrasse",
            "houseNumber": "10",
            "recipient": {
                "firstName": "Anna!",
                "lastName": "Fohlmeister",
                "gender": "m",
                "type": "personal"
            },
            "isDefault": {
                "billing": false,
                "shipping": true
            },
            "collectionPoint": {
                "customerKey": "bced-234-234",
                "description": "Pedro's Kiosk",
                "key": "12345-a",
                "type": "hermes_parcelshop"
            }
        }
    },
    "confirmedAt": "2018-01-20T11:30:15+00:00",
    "createdAt": "2018-01-20T09:30:15+00:00",
    "updatedAt": "2018-01-20T09:30:15+00:00",
    "cost": {
        "appliedFees": [
            {
                "amount": {
                    "withoutTax": 168,
                    "withTax": 200
                },
                "category": "delivery",
                "option": "deliveryCosts",
                "tax": {
                    "vat": {
                        "amount": 32,
                        "rate": 0.19
                    }
                }
            }
        ],
        "appliedReductions": [
            {
                "amount": {
                    "absoluteWithTax": 100,
                    "relative": 0.5
                },
                "category": "voucher",
                "type": "absolute"
            }
        ],
        "withTax": 1390,
        "withoutTax": 1168
    },
    "currencyCode": "EUR",
    "customer": {
        "referenceKey": "InGidcPDmL8fGkv02a3sSAgAr7ySMBfa66iw4MriYgUNI3Boq369rBOZW3stlKLWSqIjB2dXCGNbCxoM5Xww4cI8cULUoGBFJHH0"
    },
    "invoicedAt": "2018-01-22T11:30:15+00:00",
    "items": [
        {
            "deliveryForecast": {
                "subsequentDelivery": {
                    "key": "christmas"
                }
            },
            "legacyCustomData": {
                "key": "value"
            },
            "packageId": 1,
            "price": {
                "appliedReductions": [
                    {
                        "amount": {
                            "absoluteWithTax": 100,
                            "relative": 0.5
                        },
                        "category": "sale",
                        "type": "relative"
                    }
                ],
                "tax": {
                    "vat": {
                        "amount": 190,
                        "rate": 0.19
                    }
                },
                "reference": {
                    "withTax": 595,
                    "size": "100",
                    "unit": "ml"
                },
                "withTax": 1190,
                "withoutTax": 11
            },
            "product": {
                "id": 4564545
            },
            "key": "test",
            "reservationKey": "6nq69bzzkd5xufxliwg8",
            "status": "available",
            "variant": {
                "id": 1234567,
                "referenceKey": "563843898",
                "stock": {
                    "supplierId": 1
                }
            },
            "warehouseId": 12345,
            "createdAt": "2018-01-20T09:30:15+00:00",
            "updatedAt": "2018-01-20T09:30:15+00:00"
        }
    ],
    "packages": [
        {
            "carrierKey": "dhl",
            "deliveryDate": {
                "maximum": "2018-02-05",
                "minimum": "2018-02-02"
            },
            "deliveryStatus": "open",
            "shipmentKey": "shpmnt-61-1",
            "id": 1
        }
    ],
    "payment": [
        {
            "amount": 1190,
            "data": {
                "CCBrand": "VISA",
                "CCExpiry": "202005",
                "IPCity": "charlottenburg",
                "IPLatitude": "52.5151",
                "IPLongitude": "13.3053",
                "IPState": "berlin",
                "IPZone": "276",
                "IPZoneA2": "de"
            },
            "key": "accounting",
            "transactionKey": "creditcard-abcde"
        }
    ],
    "publicKey": "666",
    "referenceKey": "InGidcPDmL8fGkv02a3sSAgAr7ySMBfa66iw4MriYgUNI3Boq369rBOZW3stlKLWSqIjB2dXCGNbCxoM5Xww4cI8cULUoGBFJU2",
    "shipping": {
        "policy": "least_packages"
    },
    "status": "invoice_completed",
    "voucher": {
        "applicableItems": [
            {
                "isApplied": true,
                "key": "a87ff679a2f3e71d9181a67b7542122c"
            },
            {
                "isApplied": false,
                "key": "eccbc87e4b5ce2fe28308fd9f2a7baf3"
            }
        ],
        "code": "fashion2020",
        "type": "relative",
        "value": 1000
    },
    "legacyCustomData": {
        "key": "value"
    }
}